# n = 423                                                                 # НАХОЖДЕНИЕ СУММЫ ЧИСЕЛ ТРЁХЗНААЧНОГО ЧИСЛА
# summa = 0
# while n > 0:
#     x = n % 10
#     summa += x
#     n //= 10
# print (summa)

#--------------------------------------------------------------------------------------------------------------------------------------------



# t = [1, 'hello', "chiao", True]                                        # СПИСОК ДУБЛИРУЕТ САМ СЕБЯ
# for i in range(len(t)):
#     t.append(t[i])
#     print(t)

#--------------------------------------------------------------------------------------------------------------------------------------------



# array = [2,2,2,2,2]                                                    # ПЕРЕЗАПИСЬ СПИСКА
# for i in range(len(array)):
#     array[i] = 5
# print(array)

#--------------------------------------------------------------------------------------------------------------------------------------------



# list =  [1, 2, 3, 4, 5]                                                # СДВИГ ВСЕЙ ПОСЛЕДОВАТЕЛЬНОСТИ НА "k" ЭЛЕМЕНТОВ ВПРАВО
# k = 3

# for i in range(k):
#     temp = list[-1]
#     for j in range(len(list) - 1):
#         list[-j - 1] = list[-j - 2]
#     list[0] = temp
# print(list)
#-----------------------------------------------------------------------

#list =  [1, 2, 3, 4, 5]                                                # СДВИГ ВСЕЙ ПОСЛЕДОВАТЕЛЬНОСТИ НА "k" ЭЛЕМЕНТОВ ВПРАВО
# k = 3

# list = [i for i in range(1, int(input("Количество чисел: ")) + 1)]       
# k = int(input("Сдвиг на "))
# print()

# for i in range(k):
#     temp_list = [list[-1],]
#     for j in range(len(list) - 1):
#         temp_list.append(list[j])
#     list = temp_list
# print(list)

#--------------------------------------------------------------------

# list =  [1, 2, 3, 4, 5]                                                # СДВИГ ВСЕЙ ПОСЛЕДОВАТЕЛЬНОСТИ НА "k" ЭЛЕМЕНТОВ ВПРАВО
# k = 3

# for i in range(k): 
#     list.insert(0, list.pop())

# print(list)

#--------------------------------------------------------------------------------------------------------------------------------------------



# list = [1, 1, 1, 2, 0, -2, 5, 5, 5, 5, 1, -2, -1, 3, 4, 4, 2]         # ОЧИСТКА СПИСКА ОТ ПОВТОРЯЮЩИХСЯ ЗНАЧЕНИЙ (ПОИСК УНИКАЛЬНЫХ ЗНАЧЕНИЙ СПИСКА)
# newList = [list[0]]
# t = 1
# counter = 0

# for t in list:
#     for i in range(len(newList)):
#         if newList[i] != t:
#             counter += 1
#     if counter == len(newList):
#         newList.append(t)
#     counter = 0

# print(len(newList))
# print(newList)

#----------------------------------------------------------------

# list = [1, 1, 1, 2, 0, -2, 5, 5, 5, 5, 1, -2, -1, 3, 4, 4, 2]         # ОЧИСТКА СПИСКА ОТ ПОВТОРЯЮЩИХСЯ ЗНАЧЕНИЙ (ПОИСК УНИКАЛЬНЫХ ЗНАЧЕНИЙ СПИСКА)
# newList = [list[0]]

# for i in list:
#     if i not in newList:
#         newList.append(i)

# print(len(newList))

#--------------------------------------------------------------------------------------------------------------------------------------------



# list = [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"},                         # ВЫВОД ВСЕХ УНИКАЛЬНЫХ ЧИСЕЛ ИЗ СПИСКА СЛОВАРЕЙ
# {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII ":" S007 "}]

# newList = []

# for i in list:
#         for j in i.values():
#             newList.append(j.strip())
# print(set(newList))

#----------------------------------------------------------------

# list = [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"},                         # ВЫВОД ВСЕХ УНИКАЛЬНЫХ ЧИСЕЛ ИЗ СПИСКА СЛОВАРЕЙ
# {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII ":" S007 "}]

# newList = []

# for j in list:
#     newList += [i.strip() for i in j.values()]

# print(set(newList))

#--------------------------------------------------------------------------------------------------------------------------------------------



# list = [-2, -1, 0, -1, 5, 1000, 1, 2, 3]                                        # ПОДСЧЁТ КОЛИЧЕСТВА ЭЛЕМЕНТОВ МАССИВА, БОЛЬШИХ ПРЕДЫДУЩЕГО
# counter = 0

# for i in range(len(list) - 1):
#     if list[i + 1] > list[i]:
#         counter += 1

# print(counter)

#--------------------------------------------------------------------------------------------------------------------------------------------



# input = 'a a a b c a a d c d d'                             # ОТСЛЕЖМВАНИЕ, СКОЛЬКО РАЗ КАЖДЫЙ СИМВОЛ ВСТРЕЧАЕТСЯ В СТРОКЕ И ДОБАВЛЕНИЕ '_N'

# text = input.split()
# unLetters = {}

# for el in text:
#     if el in unLetters:
#         print(f"{el}_{unLetters[el]}", end = ' ')
#         unLetters[el] += 1
#     else:
#         print(el, end = ' ')
#         unLetters[el] = 1

#--------------------------------------------------------------------------------------------------------------------------------------------



# var1 = '1 4'                                                  # ВЫВОД СОВПАДАЮЩИХ ЭЛЕМЕНТОВ ДВУХ МНОЖЕСТВ В ПОРЯДКЕ ВОЗРАСТАНИЯ
# var2 = '1'
# var3 = '3 4 5 6'

# textList = var1.split()
# multi_1 = set(var2.split())
# multi_2 = set(var3.split())
# multi = multi_1.intersection(multi_2)
# result = list(multi)
# result.sort()

# for i in result:
#     print(i, end = ' ')

# ---------------------------------------------------------------

# textList = input("Введите числа через пробел").split()
# multi = set()
# print(textList)

# for i in textList:
#     for j in range(int(i)):
#         multi.add(input("Введите элемент(число)"))

# multi = list(multi)
# multi.sort()

# print(multi)

#--------------------------------------------------------------------------------------------------------------------------------------------



# В фермерском хозяйстве в Карелии выращивают чернику. Черника растет на круглой грядке, и кусты черники высажены по окружности грядки.
#  Каждый куст черники имеет урожайность, которая соответствует количеству ягод на этом кусте.

# Урожайность черничных кустов представлена в виде списка arr, где arr[i] - это урожайность (количество ягод) i-го куста.

# В фермерском хозяйстве внедрена система автоматического сбора черники. Эта система состоит из управляющего модуля и нескольких собирающих
#  модулей. Каждый собирающий модуль может собрать ягоды с одного куста и с двух соседних кустов. Собирающий модуль находится перед 
# определенным кустом, и он может выбирать, с какого куста начать сбор ягод.

# Ваша задача - написать программу, которая определит максимальное число ягод, которое может собрать один собирающий модуль за один заход, 
# находясь перед некоторым кустом грядки.

# Входные данные:

# На вход программе подается список arr, где arr[i] (1 ≤ arr[i] ≤ 1000) - урожайность i-го куста черники.
#  Размер списка не превышает 1000 элементов.


arr = [5, 8, 6, 4, 9, 2, 7, 3]

sumArr = []
maxSum = 0

for i in range(2, len(arr) - 1):
    sumArr.append(arr[i - 2] + arr[i - 1] + arr[i])

sumArr.append(arr[-3] + arr[-2] + arr[-1])


print(max(sumArr))